
#or ოპერატორი შემთხვევაში როცა ორი მაგალითიდან ერთი მაინც სწორია ture იწერება თუ არცერთი იქნება სწორი მაშინ folse დაიწერება
#end ოპერატორის შემტხვევაში როცა ორიდან ორივეა სწორი მხოლოდ მაშინ იწერება ture თუ მხოლოდ ერი იქნება სწორი მაშინ folse დაიწერბა








num = 5 

print("----------- AND -----------")

print(num >= 1 and num <= 10) # True იმიტო არის მარის true რომ ორივე მაგალიტი სწორია
print(num >= 1 and num <= 4) # False იმიტო არის false რომ პირველი მაგალითი სწორია მეორე მაგალიტი არასწორია
print(num > 5 and num <= 10) # False იმიტომ არის false რომ პირველი მაგალითი არასწორია მეორე სწორი
print(num > 5 and num > 10) # False იმიტომ არის false რომ ორივე მაგალითი არასწორია 

print("----------- OR -----------")

print(num >= 1 or num <= 10) # True იმიტომ არის ture რომ ორივე მაგალითი სწორია
print(num >= 1 or num <= 4) # True იმიტომ არის true რომ  ერთ მაგალითი სწორია მეორე არასწორი
print(num > 5 or num <= 10) # True იმიტომ არის true რომ პირველი მაგალითი არასწორია მეორე სწორი
print(num > 5 or num > 10) # False იმიტომ არის false რომ ორივე მაგალითი არასწორია





num2 = 9

print(num2 < 10 and num2 > 5)
print(num2 > 12 and num2 > 8)
print(num2 >= 9 and num2 < 8)
print(num2 == 9 and num2 <= 10 )
print(num2 > 10 and num2 > 5)
















